#include<stdio.h>
#include<math.h>

void prnt(){
    float f1,f2,f3;
scanf("%f", &f1);  // введення в десятковому форматі          
scanf("%e", &f2);  // введення в науковому форматі з маленькою e 
scanf("%E", &f3);  // введення в науковому форматі з великою E

double d1,d2,d3;  
scanf("%lf", &d1);  // введення в десятковому форматі          
scanf("%le", &d2);  // введення в науковому форматі з маленькою e           
scanf("%lE", &d3);  // введення в науковому форматі з великою E

long double r1, r2,r3;
scanf("%Lf", &r1);   // введення в десятковому форматі          
scanf("%Le", &r2); // введення в науковому форматі з маленькою e           
scanf("%LE", &r3); // введення в науковому форматі з великою E

//Для виведення дійсного числа можна використати наступні варіанти викликів функцій printf:

printf("%f", f1);  // виведення в десятковому форматі          
printf("%le", f2);  // введення в науковому форматі з маленькою e 
printf("%lE", f3);  // введення в науковому форматі з великою E
printf("%g", f3);  // введення в десятковому форматі з найменшою кількістю знаків

  
printf("%lf", d1);  // виведення в десятковому форматі          
printf("%le", d2);  // введення в науковому форматі з маленькою e 
printf("%lE", d3);  // введення в науковому форматі з великою E
printf("%g", d1);  // введення в десятковому форматі з найменшою кількістю знаків

printf("%Lf", r1); // виведення в десятковому форматі          
printf("%Le", r2); // введення в науковому форматі з маленькою e 
printf("%LE", r3); // введення в науковому форматі з великою E
printf("%Lg", r1);  // введення в десятковому форматі з найменшою кількістю знаків
    }

int main(){
   double x, y, z;
   scanf("%lf %lf",&x,&y);
   printf("%lf %lf",x,y);
   z = exp(x)*cos(y);
   printf("z=%lf",z);
}