#include <stdio.h>

int farenheit(){    //  òî÷êà âõîäó 
              // Âèçíà÷åííÿ òà/àáî ³í³ö³àë³çàö³ÿ ëîêàëüíèõ çì³ííèõ
   float F, C;   //âèçíà÷àºìî â³äðàçó äâ³ ä³éñí³ – çì³íí³ ‘F’ òà ‘C’ 
   printf("F="); // âèâîäèìî ï³äêàçêó äëÿ êîðèñòóâà÷à
   int res = scanf("%f", &F); // ââåäåííÿ çì³ííî¿ ‘F’
   if (res==1){
  	C=(F-32)*5/9;   /*  Îá÷èñëåííÿ çà ôîðìóëîþ */
 	printf("Celsius C=%e\n",C); /* âèâåäåííÿ çíà÷åííÿ çì³ííî¿ ‘C’ â íàóêîâîìó ôîðìàò³  */ x=0.12e02
  }
  return res; 
}

int main(){
  farenheit();
}
 
