#include <cstdio> // Link section: , бібліотека стандартного
             // вводу-виводу С інтегрована як С++ бібліотека 
#include <cmath> // заголовочний файл, 
            //бібліотека математичних функцій з С в С++           

int hello() // головна функція (main function): точка входу (entry point)
{ 
    float x; //визначаємо дійсну (одинарної точності) змінну 'x'
    scanf("%F",&x); // введення змінної 'x'
    double y=sin(x); /* Вираз (expression): виклик функції sin, 
                    обчислення виразу та 
                  ініціалізація дійсної змінної (подвійною точності) ‘y’ 
              */
     printf("Result y=%f\n",y); // виведення значення змінної y 
}
